schreibfaul1/ESP32-audioI2S/src/Audio.cpp
            if(m_playlistFormat == FORMAT_M3U)   host = parsePlaylist_M3U();
            if(m_playlistFormat == FORMAT_M3U8)  host = parsePlaylist_M3U8();
            if(m_playlistFormat == FORMAT_PLS)   host = parsePlaylist_PLS();
            if(m_playlistFormat == FORMAT_ASX)   host = parsePlaylist_ASX();

            if(host){
                if(m_playlistFormat == FORMAT_M3U8) m_f_m3u8data = true;
                if(m_f_m3u8data) AUDIO_INFO("cth %s", host);
                connecttohost(host);
            }
            else {
                m_m3u8_timeStamp = millis() + m_m3u8_targetDuration * 1200 ;
                setDatamode(AUDIO_DATA); //fake datamode, we have no new audiosequence yet, so let audio run
            }
            return;
        }

        if(m_datamode == HTTP_RESPONSE_HEADER){
            parseHttpResponseHeader();
            return;
        }

        if(m_datamode == AUDIO_DATA){
            if((m_playlistFormat == FORMAT_M3U8) && m_f_continue){ // processWebStream() needs more data
                m_f_continue = false;
                setDatamode(AUDIO_PLAYLISTDATA);

            }
            else if(m_m3u8_timeStamp > 0 && m_m3u8_timeStamp < millis()){
                m_m3u8_timeStamp = 0;
                m_f_m3u8data = true;
                connecttohost(m_lastHost);
            }
            else{
               processWebStream();
            }
        }
    }
}

//---------------------------------------------------------------------------------------------------------------------
bool Audio::readPlayListData() {
    // reads the content of the playlist and stores it in the vector m_contentlength
    // m_contentlength is a table of pointers to the lines
    char pl[512]; // playlistLine
    uint32_t ctl  = 0;
    int lines = 0;
    // delete all memory in m_playlistContent
    if(!psramFound()){log_e("m3u8 playlists requires PSRAM enabled!");}
    vector_clear_and_shrink(m_playlistContent);
    while(true){  // outer while

        uint32_t ctime = millis();
        uint32_t timeout = 2000; // ms

        while(true) { // inner while
            uint16_t pos = 0;
            while(_client->available()){ // super inner while :-))
                pl[pos] = _client->read();
                if(pl[pos] == '\n') {pl[pos] = '\0'; pos++; break;}
            //    if(pl[pos] == '&' ) {pl[pos] = '\0'; pos++; break;}
                if(pl[pos] == '\r') {pl[pos] = '\0'; pos++; break;}
                pos++;
                if(pos == 510) {pl[pos] = '\0'; break;}
            }
            ctl += pos;
            if(pos) {pl[pos] = '\0'; break;}
            if(ctime + timeout < millis()) {log_e("timeout"); break;}
        } // inner while

        if(m_contentlength > 0){
            // we have one line only, terminate all crap
            if(m_contentlength < strlen(pl)) {log_e("%i", m_contentlength); pl[m_contentlength] = '\0';}
            // we have more line but no '\n' at the and -> terminate all crap
            else if(m_contentlength < ctl){
                int diff = ctl - m_contentlength;
                int lastpos = strlen(pl) - diff;
                pl[lastpos] = '\0';
            }
        }

        if(startsWith(pl, "<!DOCTYPE")) {AUDIO_INFO("url is a webpage!"); goto exit;}
        if(strlen(pl) > 0) m_playlistContent.push_back(strdup((const char*)pl));
        if(m_playlistContent.size() == 100){
            ESP_LOGD("", "the maximum number of lines in the playlist has been reached");
            break;
        }
        if(ctl == m_contentlength){break;}
        if(!m_contentlength && !_client->available()) break;

    } // outer while6nUfOrsqhhT-331
    lines = m_playlistContent.size();
    for (int i = 0; i < lines ; i++) { // print all string in first vector of 'arr'
        ESP_LOGD("pl=", "%i \"%s\"", i, m_playlistContent[i]);
    }
    m_datamode = AUDIO_PLAYLISTDATA;
    return true;

    exit:
        vector_clear_and_shrink(m_playlistContent);
        m_f_running = false;
        m_datamode = AUDIO_NONE;
    return false;
}
//----------------------------------------------------------------------------------------------------------------------
const char* Audio::parsePlaylist_M3U(){
    uint8_t lines = m_playlistContent.size();
    int pos = 0;
    char* host = nullptr;

    for(int i= 0; i < lines; i++){
        if(indexOf(m_playlistContent[i], "#EXTINF:") >= 0) {            // Info?
            pos = indexOf(m_playlistContent[i], ",");                   // Comma in this line?
            if(pos > 0) {
                // Show artist and title if present in metadata
                AUDIO_INFO(m_playlistContent[i] + pos + 1);
            }
            continue;
        }
        if(startsWith(m_playlistContent[i], "#")) {                     // Commentline?
            continue;
        }

        pos = indexOf(m_playlistContent[i], "http://:@", 0);            // ":@"??  remove that!
        if(pos >= 0) {
            AUDIO_INFO("Entry in playlist found: %s", (m_playlistContent[i] + pos + 9));
            host = m_playlistContent[i] + pos + 9;
            break;
        }
        // AUDIO_INFO("Entry in playlist found: %s", pl);
        pos = indexOf(m_playlistContent[i], "http", 0);                 // Search for "http"
        if(pos >= 0) {                                                  // Does URL contain "http://"?
    //    log_e("%s pos=%i", m_playlistContent[i], pos);
            host = m_playlistContent[i] + pos;                        // Yes, set new host
            break;
        }
    }
    vector_clear_and_shrink(m_playlistContent);
    return host;
}
//----------------------------------------------------------------------------------------------------------------------
const char* Audio::parsePlaylist_PLS(){
    uint8_t lines = m_playlistContent.size();
    int pos = 0;
    char* host = nullptr;

    for(int i= 0; i < lines; i++){
        if(i == 0){
            if(strlen(m_playlistContent[0]) == 0) goto exit;            // empty line
            if(strcmp(m_playlistContent[0] , "[playlist]") != 0){       // first entry in valid pls
                m_datamode = HTTP_RESPONSE_HEADER;                      // pls is not valid
                AUDIO_INFO("pls is not valid, switch to HTTP_RESPONSE_HEADER");
                goto exit;
            }
            continue;
        }
        if(startsWith(m_playlistContent[i], "File1")) {
            if(host) continue;                                          // we have already a url
            pos = indexOf(m_playlistContent[i], "http", 0);             // File1=http://streamplus30.leonex.de:14840/;
            if(pos >= 0) {                                              // yes, URL contains "http"?
                host = m_playlistContent[i] + pos;                      // Now we have an URL for a stream in host.
            }
            continue;
        }
        if(startsWith(m_playlistContent[i], "Title1")) {                // Title1=Antenne Tirol
            const char* plsStationName = (m_playlistContent[i] + 7);
            if(audio_showstation) audio_showstation(plsStationName);
            AUDIO_INFO("StationName: \"%s\"", plsStationName);
            continue;
        }
        if(startsWith(m_playlistContent[i], "Length1")){
            continue;
        }
        if(indexOf(m_playlistContent[i], "Invalid username") >= 0){     // Unable to access account:
            goto exit;                                                  // Invalid username or password
        }
    }
    return host;

