schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(!f_stream) return; // 1. guard
    bool a = InBuff.bufferFilled() >= maxFrameSize;
    bool b = (m_audioDataSize  > 0) && (m_audioDataSize <= audioDataCount + maxFrameSize);
    if(!a && !b) return; // 2. guard   fill < frame && last frame(s)

    size_t data2decode = InBuff.bufferFilled();

    if(data2decode < maxFrameSize){
        if(m_audioDataSize - audioDataCount < maxFrameSize){
            data2decode = m_audioDataSize - audioDataCount;
        }
        else return;
    }
    else data2decode = maxFrameSize;

    if(m_f_webfile){
        bytesDecoded = sendBytes(InBuff.getReadPtr(), data2decode);
        if(bytesDecoded > 0) audioDataCount += bytesDecoded;

        if(byteCounter == m_contentlength){
            if(m_playlistFormat == FORMAT_M3U8){
                byteCounter = 0;
                m_metacount = m_metaint;
                m_f_continue = true;
                return;
            }
            f_webFileDataComplete = true;
        }
        if(m_audioDataSize == audioDataCount &&  m_controlCounter == 100) f_webFileAudioComplete = true;
    }
    else { // not a webfile
        if(m_controlCounter != 100 && (m_codec == CODEC_OGG || m_codec == CODEC_OGG_FLAC)) {  //application/ogg
            int res = read_OGG_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
            if(res >= 0) bytesDecoded = res;
            else { // error, skip header
                stopSong();
                m_controlCounter = 100;
            }
        }
        else{
            bytesDecoded = sendBytes(InBuff.getReadPtr(), data2decode);
        }
    }

    if(bytesDecoded < 0) {  // no syncword found or decode error, try next chunk
        uint8_t next = 200;
        if(InBuff.bufferFilled() < next) next = InBuff.bufferFilled();
        InBuff.bytesWasRead(next); // try next chunk
        m_bytesNotDecoded += next;
        if(m_f_webfile) audioDataCount += next;
        return;
    }
    else {
        if(bytesDecoded > 0) {InBuff.bytesWasRead(bytesDecoded); return;}
        if(bytesDecoded == 0) return; // syncword at pos0 found
    }
    return;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::parseHttpResponseHeader() { // this is the response to a GET / request

    char rhl[512]; // responseHeaderline
    bool ct_seen = false;
    uint32_t ctime = millis();
    uint32_t timeout = 5000; // ms

    while(true){  // outer while
        uint16_t pos = 0;
        if((millis() - ctime) > timeout) {
			ESP_LOGE("parseHttpResponseHeader", "timeout");
            goto exit;
		}
        while(_client->available()){
            uint8_t b = _client->read();
            if(b == '\n') {
                if(!pos){ // empty line received, is the last line of this responseHeader
                    if(ct_seen) goto lastToDo;
                    else goto exit;
                }
				break;
            }
            if(b == '\r') rhl[pos] = 0;
            if(b < 0x20) continue;
            rhl[pos] = b;
            pos++;
            if(pos == 510){
                rhl[pos] = '\0';
                ESP_LOGD("", "responseHeaderline overflow");
                break;
            }
        } // inner while

        if(!pos) {vTaskDelay(3);  continue;}

        if(m_f_Log) {AUDIO_INFO("httpResponseHeader: %s", rhl);}

        int16_t posColon = indexOf(rhl, ":", 0); // lowercase all letters up to the colon
        if(posColon >= 0) {
            for(int i=0; i< posColon; i++) {
                rhl[i] = toLowerCase(rhl[i]);
            }
        }

        int16_t idx = indexOf(rhl, "HTTP/");  // HTTP status error code
        if(idx >= 0){
            char statusCode[5];
            statusCode[0] = rhl[idx + 9];
            statusCode[1] = rhl[idx + 10];
            statusCode[2] = rhl[idx + 11];
            statusCode[3] = '\0';
            int sc = atoi(statusCode);
            if(sc > 310 || sc == 301){ // e.g. HTTP/1.1 301 Moved Permanently
                AUDIO_INFO(rhl);
                if(audio_showstreamtitle) audio_showstreamtitle(rhl);
            //    goto exit;
            }
        }

        idx = indexOf(rhl, "content-type:", 0); // content-type: text/html; charset=UTF-8
        if(idx >= 0) {
        //    AUDIO_INFO("%s", rhl);
            idx = indexOf(rhl + 13, ";");
            if(idx >0) rhl[13 + idx] = '\0';
            if(parseContentType(rhl + 13)) ct_seen = true;
            else goto exit;
        }

        if(startsWith(rhl, "location:")) {
            int pos = indexOf(rhl, "http", 0);
            if(pos >= 0){
                const char* c_host = (rhl + pos);
                if(strcmp(c_host, m_lastHost) != 0) { // prevent a loop
                    if(m_playlistFormat == FORMAT_M3U8) {strcpy(m_lastHost, c_host); m_f_m3u8data = true;} // extension has changed but host is the same?
                    AUDIO_INFO("redirect to new host \"%s\"", c_host);
                    connecttohost(c_host);
                    return true;
                }
            }
        }

        if(startsWith(rhl, "content-encoding:")){
            if(indexOf(rhl, "gzip")){
                AUDIO_INFO("can't extract gzip");
                goto exit;
            }
        }

        if(startsWith(rhl, "content-disposition:")) {
            int pos1, pos2; // pos3;
            // e.g we have this headerline:  content-disposition: attachment; filename=stream.asx
            // filename is: "stream.asx"
            pos1 = indexOf(rhl, "filename=", 0);
            if(pos1 > 0){
                pos1 += 9;
                if(rhl[pos1] == '\"') pos1++;  // remove '\"' around filename if present
                pos2 = strlen(rhl);
                if(rhl[pos2 - 1] == '\"') rhl[pos2 - 1] = '\0';
            }
            AUDIO_INFO("Filename is %s", rhl + pos1);
        }

        // if(startsWith(rhl, "set-cookie:")         ||
        //         startsWith(rhl, "pragma:")        ||
        //         startsWith(rhl, "expires:")       ||
        //         startsWith(rhl, "cache-control:") ||
        //         startsWith(rhl, "icy-pub:")       ||
        //         startsWith(rhl, "p3p:")           ||
        //         startsWith(rhl, "accept-ranges:") ){
        //     ; // do nothing
        // }

        if(startsWith(rhl, "connection:")) {
            if(indexOf(rhl, "close", 0) >= 0) {; /* do nothing */}
        }

        if(startsWith(rhl, "icy-genre:")) {
            ; // do nothing Ambient, Rock, etc
        }

        if(startsWith(rhl, "icy-br:")) {
            const char* c_bitRate = (rhl + 7);
            int32_t br = atoi(c_bitRate); // Found bitrate tag, read the bitrate in Kbit
            br = br * 1000;
            setBitrate(br);
            sprintf(chbuf, "%d", getBitRate());
            if(audio_bitrate) audio_bitrate(chbuf);
        }

        if(startsWith(rhl, "icy-metaint:")) {
            const char* c_metaint = (rhl + 12);
            int32_t i_metaint = atoi(c_metaint);
            m_metaint = i_metaint;
            if(m_metaint) m_f_swm = false     ;                            // Multimediastream
        }

