schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    inSample[LEFTCHANNEL]  = (float)(iir_in[LEFTCHANNEL]);
    inSample[RIGHTCHANNEL] = (float)(iir_in[RIGHTCHANNEL]);

    outSample[LEFTCHANNEL] =   m_filter[1].a0  * inSample[LEFTCHANNEL]
                             + m_filter[1].a1  * m_filterBuff[1][z1][in] [LEFTCHANNEL]
                             + m_filter[1].a2  * m_filterBuff[1][z2][in] [LEFTCHANNEL]
                             - m_filter[1].b1  * m_filterBuff[1][z1][out][LEFTCHANNEL]
                             - m_filter[1].b2  * m_filterBuff[1][z2][out][LEFTCHANNEL];

    m_filterBuff[1][z2][in] [LEFTCHANNEL]  = m_filterBuff[1][z1][in][LEFTCHANNEL];
    m_filterBuff[1][z1][in] [LEFTCHANNEL]  = inSample[LEFTCHANNEL];
    m_filterBuff[1][z2][out][LEFTCHANNEL]  = m_filterBuff[1][z1][out][LEFTCHANNEL];
    m_filterBuff[1][z1][out][LEFTCHANNEL]  = outSample[LEFTCHANNEL];
    iir_out[LEFTCHANNEL] = (int16_t)outSample[LEFTCHANNEL];


    outSample[RIGHTCHANNEL] =  m_filter[1].a0 * inSample[RIGHTCHANNEL]
                             + m_filter[1].a1 * m_filterBuff[1][z1][in] [RIGHTCHANNEL]
                             + m_filter[1].a2 * m_filterBuff[1][z2][in] [RIGHTCHANNEL]
                             - m_filter[1].b1 * m_filterBuff[1][z1][out][RIGHTCHANNEL]
                             - m_filter[1].b2 * m_filterBuff[1][z2][out][RIGHTCHANNEL];

    m_filterBuff[1][z2][in] [RIGHTCHANNEL] = m_filterBuff[1][z1][in][RIGHTCHANNEL];
    m_filterBuff[1][z1][in] [RIGHTCHANNEL] = inSample[RIGHTCHANNEL];
    m_filterBuff[1][z2][out][RIGHTCHANNEL] = m_filterBuff[1][z1][out][RIGHTCHANNEL];
    m_filterBuff[1][z1][out][RIGHTCHANNEL] = outSample[RIGHTCHANNEL];
    iir_out[RIGHTCHANNEL] = (int16_t) outSample[RIGHTCHANNEL];

    return iir_out;
}
//---------------------------------------------------------------------------------------------------------------------
int16_t* Audio::IIR_filterChain2(int16_t iir_in[2], bool clear){  // Infinite Impulse Response (IIR) filters

    uint8_t z1 = 0, z2 = 1;
    enum: uint8_t {in = 0, out = 1};
    float inSample[2];
    float outSample[2];
    static int16_t iir_out[2];

    if(clear){
        memset(m_filterBuff, 0, sizeof(m_filterBuff));            // zero IIR filterbuffer
        iir_out[0] = 0;
        iir_out[1] = 0;
        iir_in[0]  = 0;
        iir_in[1]  = 0;
    }

    inSample[LEFTCHANNEL]  = (float)(iir_in[LEFTCHANNEL]);
    inSample[RIGHTCHANNEL] = (float)(iir_in[RIGHTCHANNEL]);

    outSample[LEFTCHANNEL] =   m_filter[2].a0  * inSample[LEFTCHANNEL]
                             + m_filter[2].a1  * m_filterBuff[2][z1][in] [LEFTCHANNEL]
                             + m_filter[2].a2  * m_filterBuff[2][z2][in] [LEFTCHANNEL]
                             - m_filter[2].b1  * m_filterBuff[2][z1][out][LEFTCHANNEL]
                             - m_filter[2].b2  * m_filterBuff[2][z2][out][LEFTCHANNEL];

    m_filterBuff[2][z2][in] [LEFTCHANNEL]  = m_filterBuff[2][z1][in][LEFTCHANNEL];
    m_filterBuff[2][z1][in] [LEFTCHANNEL]  = inSample[LEFTCHANNEL];
    m_filterBuff[2][z2][out][LEFTCHANNEL]  = m_filterBuff[2][z1][out][LEFTCHANNEL];
    m_filterBuff[2][z1][out][LEFTCHANNEL]  = outSample[LEFTCHANNEL];
    iir_out[LEFTCHANNEL] = (int16_t)outSample[LEFTCHANNEL];


    outSample[RIGHTCHANNEL] =  m_filter[2].a0 * inSample[RIGHTCHANNEL]
                             + m_filter[2].a1 * m_filterBuff[2][z1][in] [RIGHTCHANNEL]
                             + m_filter[2].a2 * m_filterBuff[2][z2][in] [RIGHTCHANNEL]
                             - m_filter[2].b1 * m_filterBuff[2][z1][out][RIGHTCHANNEL]
                             - m_filter[2].b2 * m_filterBuff[2][z2][out][RIGHTCHANNEL];

    m_filterBuff[2][z2][in] [RIGHTCHANNEL] = m_filterBuff[2][z1][in][RIGHTCHANNEL];
    m_filterBuff[2][z1][in] [RIGHTCHANNEL] = inSample[RIGHTCHANNEL];
    m_filterBuff[2][z2][out][RIGHTCHANNEL] = m_filterBuff[2][z1][out][RIGHTCHANNEL];
    m_filterBuff[2][z1][out][RIGHTCHANNEL] = outSample[RIGHTCHANNEL];
    iir_out[RIGHTCHANNEL] = (int16_t) outSample[RIGHTCHANNEL];

    return iir_out;
}
//----------------------------------------------------------------------------------------------------------------------
//    AAC - T R A N S P O R T S T R E A M
//----------------------------------------------------------------------------------------------------------------------
void Audio::ts_parsePAT(uint8_t *pat)
{
  int startOfProgramNums = 8;
  int lengthOfPATValue = 4;
  int sectionLength = ((pat[1] & 0x0F) << 8) | (pat[2] & 0xFF);
  log_v("Section Length: %d", sectionLength);
  int indexOfPids = 0;
  for (int i = startOfProgramNums; i <= sectionLength; i += lengthOfPATValue)
  {
    //int program_number = ((pat[i] & 0xFF) << 8) | (pat[i + 1] & 0xFF);
    //log_v("Program Num: 0x%04X(%d)", program_number, program_number);
    int program_map_PID = ((pat[i + 2] & 0x1F) << 8) | (pat[i + 3] & 0xFF);
    log_v("PMT PID: 0x%04X(%d)", program_map_PID, program_map_PID);
    m_pidsOfPMT.pids[indexOfPids++] = program_map_PID;
  }
  m_pidsOfPMT.number = indexOfPids;
}

void Audio::ts_parsePMT(uint8_t *pat)
{
  int staticLengthOfPMT = 12;
  int sectionLength = ((pat[1] & 0x0F) << 8) | (pat[2] & 0xFF);
  log_v("Section Length: %d", sectionLength);
  int programInfoLength = ((pat[10] & 0x0F) << 8) | (pat[11] & 0xFF);
  log_v("Program Info Length: %d", programInfoLength);

  int cursor = staticLengthOfPMT + programInfoLength;
  while (cursor < sectionLength - 1)
  {
    int streamType = pat[cursor] & 0xFF;
    int elementaryPID = ((pat[cursor + 1] & 0x1F) << 8) | (pat[cursor + 2] & 0xFF);
    log_v("Stream Type: 0x%02X(%d) Elementary PID: 0x%04X(%d)",
          streamType, streamType, elementaryPID, elementaryPID);

    if (streamType == 0x0F || streamType == 0x11) m_pidOfAAC = elementaryPID;

    int esInfoLength = ((pat[cursor + 3] & 0x0F) << 8) | (pat[cursor + 4] & 0xFF);
    log_v("ES Info Length: 0x%04X(%d)", esInfoLength, esInfoLength);
    cursor += 5 + esInfoLength;
  }
}

int Audio::ts_parsePES(uint8_t *pat, int posOfPacketStart, uint8_t *data)
{
  size_t dataSize;
  if (m_pesDataLength > 0)
  {
    dataSize = m_tsPacketSize - posOfPacketStart;
    memcpy(data, pat, dataSize);
    m_pesDataLength -= dataSize;
    return dataSize;
  }
  else
  {
    uint8_t firstByte  = pat[0] & 0xFF;
    uint8_t secondByte = pat[1] & 0xFF;
    uint8_t thirdByte  = pat[2] & 0xFF;
    if (firstByte == 0x00 && secondByte == 0x00 && thirdByte == 0x01)
    {
      uint8_t streamID = pat[3] & 0xFF;
      if(streamID < 0xC0 || streamID > 0xDF){
        Serial.printf("Stream ID:%02X ", streamID);
        if(0xE0 <= streamID && streamID <= 0xEF){
        Serial.println("This is a Stream ID for Video.");
        }else{
        Serial.println("Wrong Stream ID for Audio.");
        }
        exit(1);
      }
      const uint8_t posOfPacketLengthLatterHalf = 5;
      uint16_t PESRemainingPacketLength = ((pat[4] & 0xFF) << 8) | (pat[5] & 0xFF);
      log_v("PES Packet length: %d", PESRemainingPacketLength);
      m_pesDataLength = PESRemainingPacketLength;
      const uint8_t posOfHeaderLength = 8;
      uint8_t PESRemainingHeaderLength = pat[posOfHeaderLength] & 0xFF;
      log_v("PES Header length: %d", PESRemainingHeaderLength);
      int startOfData = posOfHeaderLength + PESRemainingHeaderLength + 1;
      dataSize = (m_tsPacketSize - posOfPacketStart) - startOfData;
      memcpy(data, &pat[startOfData], dataSize);
      m_pesDataLength -= (m_tsPacketSize - posOfPacketStart) - (posOfPacketLengthLatterHalf + 1);
      return dataSize;
    }
  }
  return 0;
}

int Audio::ts_parsePacket(uint8_t *packet, uint8_t *data)
{
  int read = 0;

  int pid = ((packet[1] & 0x1F) << 8) | (packet[2] & 0xFF);
  log_v("PID: 0x%04X(%d)", pid, pid);
  int payloadUnitStartIndicator = (packet[1] & 0x40) >> 6;
  log_v("Payload Unit Start Indicator: %d", payloadUnitStartIndicator);
  int adaptionFieldControl = (packet[3] & 0x30) >> 4;
  log_v("Adaption Field Control: %d", adaptionFieldControl);
  int remainingAdaptationFieldLength = -1;
  if ((adaptionFieldControl & 0b10) == 0b10)
  {
    remainingAdaptationFieldLength = packet[4] & 0xFF;
    log_v("Adaptation Field Length: %d", remainingAdaptationFieldLength);
  }

  int payloadStart = payloadUnitStartIndicator ? 5 : 4;

  if (pid == 0){
    ts_parsePAT(&packet[payloadStart]);
  } else if (pid == m_pidOfAAC){
    int posOfPacketStart = 4;
    if (remainingAdaptationFieldLength >= 0) posOfPacketStart = 5 + remainingAdaptationFieldLength;
    read = ts_parsePES(&packet[posOfPacketStart], posOfPacketStart, data);
  } else if (m_pidsOfPMT.number){
    for (int i = 0; i < m_pidsOfPMT.number; i++){
      if (pid == m_pidsOfPMT.pids[i]){
        ts_parsePMT(&packet[payloadStart]);
      }
    }
  }

  return read;
}
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
